## 一封信

这是一封写给那些需要帮助的人，比如刚毕业不知如何择业想从事计算机行业的，又或者从业几年了想转行去写代码，还有从培训班出来的童鞋们等

### 为什么需要写这封信

虽然自己在一家n线传统行业某数字化事业部门负责移动端组，通过这些年的带队经验及面试情况，真的颇有感触，所以想写以一封信的形式悄悄地跟你们说。 想通过这个网站来为你迷茫的道路上点一盏灯，指引你去远方。

### 大厂梦

一直有一个大厂梦，当你从一个n流大学毕业，在没有人指导的情况下，虽然都完成了当初指定的目标，但是随着时间流逝着， 去大厂的希望也就慢慢变得渺茫了。一路走来，因为走的不是捷径，当你积累的知识足够去大厂时，发现自己有些力不从心了。 希望那些奋斗在一线的大厂的哥们，继续为自己的目标勇往直前，但是在加班的路上不要丢了自己的梦想。

### 二线城市的开发者

前段时间去了趟Z城市招几个Java开发工程师，按目前的称呼是准一线，高楼林立。通过两天的面试，发现都是搬砖的，即使工作了8年。 在那边呆了2天，最大的感触就是比较轻松，跟上海的节奏完全不一样，是真的舒服。我想应该也有很不错的公司，技术氛围也很不错。 如果你没有找到好一点的公司，并且对技术有追求，去一线城市，找个稍微好一点的公司沉淀下来。

### 工作了若干年，仍在一线编码

当然也有例外，有人会说我喜欢敲代码，这个事也是你情我愿。但是大部分人可能不这样想，或许你听说过程序员是一个吃青春饭的职业，这种说法不是没有道理的。 比如：你身处一线某厂，经常加班到凌晨，每周至少996，如果你能坚持5年，就算很不错了。但是你有没有想过30岁以后、40岁以后呢，怎么办？ To be or not to be，that's a question.所以，要有目标、有计划性地度过你美好的青春年华，怎么弄呢？后面再开篇讲，可以关注我的公众号。

### 刚从培训班出来的

首先，明确一点，去培训没什么丢人的，在自己身边没有资源的同学，可以去参加培训，但是不要为了省钱反而被坑，这点培训费后面都会赚回来的。 简单的编码并不是那么难，在培训的时候认真听课，多去思考，多花时间去学习补短，几个月的时间上手写点代码还是可以的。培训完找份工作， 要先有一份能稳定一点工作，这样你才能在后续的几年的时间去充实自己。

### 非计算机专业的

一定要补计算机专业知识的，如果你想拿更高的薪水，这个短板是你必须补的。在面试的时候，经常有学历造假，并且简历上写着软件工程专业， 我一般首先会问数据结构，一看回答支支吾吾的，立马会问你简历是不是有问题，后面基本上就没有然后了。需要补的专业知识有《微机原理》、《数据结构》、 《算法》、《计算机原理》、《计算机网络》、《软件工程》、《软件测试》等

### 快毕业了

择业当然首先需要根据自身的硬件条件，其实这都还不是最重要的，最重要的是你的理想是什么？

### 结语

国内这几年，计算机行业发展的比较迅速，但是跟美国的一线公司比较还是差不少，所以想以这种方式指引有想在这方面有所建树的童鞋。 希望国内有越来越多的50岁以上大叔级别的老码农，这样计算机行业会出现更多有趣的故事。
